porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcyHorizontal2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xMin 0;
xMax 10;
yMin 0;
yMax 10;
zMin 0;
zMax 1;

Nx 10;
Ny 10;
Nz 1;

vertices
(
    ($xMin $yMin $zMin) // 0
    ($xMax $yMin $zMin) // 1
    ($xMax $yMax $zMin) // 2
    ($xMin $yMax $zMin) // 3
    ($xMin $yMin $zMax) // 4
    ($xMax $yMin $zMax) // 5
    ($xMax $yMax $zMax) // 6
    ($xMin $yMax $zMax) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($Nx $Ny $Nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

 walls
 {
   type wall;
   faces
        (
         (0 4 7 3)
         (1 5 6 2)
         (3 7 6 2) 
         (0 4 5 1)
        );   
 }

 topAndBottume
 {
   type empty;
   faces
        (
         (4 5 6 7)
         (0 3 2 1)
        );   
 }
 
);

mergePatchPairs
(
);

// ************************************************************************* //
