porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcyHorizontal2D/constant/wellboreProperties
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  5.0                                   |
  |   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      wellboreProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//////production1

well.Pro1
   {
     
	   activeWell	                    activeWell [ 0 0 0 0 0 0 0 ]                    1; 

           activeTimeCondition              activeTimeCondition [ 0 0 0 0 0 0 0 ]           1;
           timeCondition                    timeCondition [ 0 0 1 0 0 0 0 ]	           50;
  
           activeQCondition                 activeQCondition [ 0 0 0 0 0 0 0 ]              0;
           qCondition                       qCondition [ 0 3 -1 0 0 0 0 ]	         1e-3;        
           
           activeGorCondition               activeGorCondition [ 0 0 0 0 0 0 0 ]            0;
           gorCondition                     gorCondition [ 0 0 0 0 0 0 0 ]	          100;
            
           lessTimeConditionPlan                                                       qConst;
           moreTimeConditionPlan                                                       qConst;
           
           lessQConditionPlan                                                          pConst;
           moreQConditionPlan                                                          qConst;
  
           lessGorConditionPlan                                                        pConst;
           moreGorConditionPlan                                                        pConst;
           
           qConstant	                    qConstant [ 0 3 -1 0 0 0 0 ]                0.001;

           volume                           volume [ 0 3 0 0 0 0 0 ]	                    1;
           radius                           radius [ 0 1 0 0 0 0 0 ]	              0.03048;
	   deltax                           deltax [ 0 1 0 0 0 0 0 ]	                    1;
	   deltay                           deltay [ 0 1 0 0 0 0 0 ]	                    1;
           height                           height [ 0 1 0 0 0 0 0 ]	                    2;
           pb                               pb [ 1 -1 -2 0 0 0 0 ]	              5600000;              //bottumhole Pressure// 
           zCoordinate                      zCoordinate [ 0 1 0 0 0 0 0]         (9.5 0.5 0.5);
	
     
   } 
/////////////// 


//////injection1

well.Inj1
   {  
          activeWell	                   activeWell [ 0 0 0 0 0 0 0 ]                    1; 

           activeTimeCondition             activeTimeCondition [ 0 0 0 0 0 0 0 ]            1;
           timeCondition                   timeCondition [ 0 0 1 0 0 0 0 ]	           50;
  
           activeQCondition                activeQCondition [ 0 0 0 0 0 0 0 ]               0;
           qCondition                      qCondition [ 0 3 -1 0 0 0 0 ]	         1e-3;        
           
           activeGorCondition              activeGorCondition [ 0 0 0 0 0 0 0 ]             0;
           gorCondition                    gorCondition [ 0 0 0 0 0 0 0 ]	           64;
             
           lessTimeConditionPlan                                                       qConst;
           moreTimeConditionPlan                                                       qConst;
            
           lessQConditionPlan                                                          qConst;
           moreQConditionPlan                                                          pConst;

           lessGorConditionPlan                                                        pConst;
           moreGorConditionPlan                                                        pConst;
               
           qConstant	                   qConstant [ 0 3 -1 0 0 0 0 ]                 0.001;

           volume                          volume [ 0 3 0 0 0 0 0 ]	                    1;
           radius                          radius [ 0 1 0 0 0 0 0 ]	              0.03048;
	   deltax                          deltax [ 0 1 0 0 0 0 0 ]	                    1;
	   deltay                          deltay [ 0 1 0 0 0 0 0 ]	                    1;
           height                          height [ 0 1 0 0 0 0 0 ]	                    2;
           pb                              pb [ 1 -1 -2 0 0 0 0 ]	              5000000;            //bottumhole Pressure// 
           zCoordinate                      zCoordinate [ 0 1 0 0 0 0 0]        (0.5 0.5 9.5);

   } 
///////////////  


// ************************************************************************* //
