porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcyHorizontal2D/system/setFieldsDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
	volTensorFieldValue K     (3e-13 0 0 0 3e-13 0 0 0 3e-13)
	volScalarFieldValue WInj1 0
	volScalarFieldValue WPro1 0
);



regions
(
    // injection
   boxToCell
   {
     box (0 0 0) (1 1 1);
     fieldValues
	(
	   volScalarFieldValue WInj1 1 
     	);
   }   

   // production
    boxToCell
   {
     box (9 9 0) (10 10 1);
     fieldValues
        (
           volScalarFieldValue WPro1 1 
        );
   }

   // layer2
    boxToCell
   {
     box (0 3 0) (10 7 1);
     fieldValues
        (
           volTensorFieldValue K  (3e-13 0 0 0 3e-13 0 0 0 3e-13)
        );
   }     
     
   // layer3
    boxToCell
   {
     box (0 7 0) (10 10 1);
     fieldValues
        (
           volTensorFieldValue K  (3e-13 0 0 0 3e-13 0 0 0 3e-13)
        );
   }           
     
  

);



